
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодразделенияИнициатора = Параметры.СписокПодразделений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Подразделения.Ссылка КАК Подразделение,
				   |	" + ?(ЗначениеЗаполнено(ПодразделенияИнициатора), "
	               |	ВЫБОР
	               |		КОГДА Подразделения.Ссылка В (&СписокПодразделений)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ ", "ЛОЖЬ") + "
				   |	КАК Отметка
	               |ИЗ
	               |	Справочник.Подразделения КАК Подразделения
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Подразделение ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("СписокПодразделений", ПодразделенияИнициатора);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ВсеПодразделения = Не ЗначениеЗаполнено(ПодразделенияИнициатора);
	
	ЗначениеВРеквизитФормы(Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией), "Подразделения");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	МассивПодразделений = Новый Массив;
	
	Если Не ВсеПодразделения Тогда
		МассивСтрок = ДанныеФормыВЗначение(Подразделения, Тип("ДеревоЗначений")).Строки.НайтиСтроки(Новый Структура("Отметка", Истина), Истина);
		Для Каждого СтрокаМассива Из МассивСтрок Цикл
			МассивПодразделений.Добавить(СтрокаМассива.Подразделение);	
		КонецЦикла;
	КонецЕсли;	
		
	Закрыть(МассивПодразделений);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияОтметкаПриИзменении(Элемент)
	
	ТеущаяСтрока = Подразделения.НайтиПоИдентификатору(Элементы.Подразделения.ТекущаяСтрока);
	
	Если ВсеПодразделения Тогда
		Если ТеущаяСтрока.Отметка Тогда
			ВсеПодразделения = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//УстановитьПризнакОтметкаДляПодчиненныхСтрок(ТеущаяСтрока, ТеущаяСтрока.Отметка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеПодразделенияПриИзменении(Элемент)
	
	Если ВсеПодразделения Тогда
		УстановитьПризнакОтметкаДляПодчиненныхСтрок(Подразделения, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПризнакОтметкаДляПодчиненныхСтрок(КоллекцияЭлементов, Отметка)

	ЭлементыДерева = КоллекцияЭлементов.ПолучитьЭлементы();
	
	Для Каждого Элемент Из ЭлементыДерева Цикл
		Элемент.Отметка = Отметка;	
		УстановитьПризнакОтметкаДляПодчиненныхСтрок(Элемент, Отметка)
	КонецЦикла;

КонецПроцедуры // УстановитьПризнакОтметкаДляПодчиненныхСтрок()



